{
    "categories":[
        {    
            "category":"Company Name",
            "definition": "The official name of the business entity as registered with relevant legal authorities. This name is used in all legal documents, financial reports, and business communications. It represents the identity of the company in the market and among stakeholders.",
            "other_terms": ["Business Name", "Legal Name", "Corporate Name"]
        },
        {
            "category":"Fiscal Year",
            "definition": "A one-year period that companies use for financial reporting and budgeting. It may not align with the calendar year and can vary depending on the company's accounting practices. The fiscal year is used to prepare annual financial statements, tax filings, and performance evaluations.",
            "other_terms": ["Financial Year", "Accounting Year", "Reporting Year"]
        },
        {
            "category":"Report Date",
            "definition": "The specific date on which a financial report is issued. This date signifies the point in time at which the information in the report is relevant and accurate. It is important for stakeholders to know the report date to understand the timeliness of the financial information presented.",
            "other_terms": ["Publication Date", "Release Date", "Statement Date"]
        },
        {
            "category":"Currency",
            "definition": "The monetary unit in which financial transactions and statements are denominated. This indicates the type of money used in the financial statements, such as USD (United States Dollar), EUR (Euro), or JPY (Japanese Yen). It is crucial for stakeholders to know the currency to accurately interpret the financial data.",
            "other_terms": ["Monetary Unit", "Cash Unit", "Denomination"]
        },
        {
            "category":"Summary",
            "definition": "A brief overview of the enterprise, its activities, and its core operations. This section provides a high-level description of what the company does, its mission and vision, key products or services, and its market position. The summary helps stakeholders quickly understand the business and its primary functions.",
            "other_terms": ["Executive Summary", "Company Overview", "Business Summary"]
        },
        {
            "category":"Total earnings",
            "definition": "The total revenue generated by the company from its core business activities before any expenses are subtracted. This figure represents the company's ability to generate income from its operations and is a key indicator of business performance.",
            "other_terms": ["Total Revenue", "Gross Income", "Gross Revenue"]
        },
        {
            "category":"Total Net Income",
            "definition": "The total profit remaining after all expenses, taxes, and costs have been subtracted from total revenue. It represents the company's actual profitability and is a critical measure of financial health and performance.",
            "other_terms": ["Net Profit", "Net Earnings", "Bottom Line"]
        },
        {
            "category":"Total Operating Income",
            "definition": "The profit realized from a business's core operations, excluding income from investments and non-operating activities. This metric shows the company's efficiency in managing its core business activities.",
            "other_terms": ["Operating Profit", "Operating Earnings", "Operating Revenue"]
        },
        {
            "category":"Total Expenses",
            "definition": "The total cost incurred by the company to run its operations, including costs of goods sold, administrative expenses, and other operating costs. This figure helps stakeholders understand the overall cost structure of the company.",
            "other_terms": ["Total Costs", "Total Outlays", "Total Expenditures"]
        },
        {
            "category":"Cost of Goods Sold (COGS)",
            "definition": "The direct costs attributable to the production of the goods sold by the company. This includes costs such as raw materials, labor, and manufacturing overhead. COGS is an essential component in calculating the company's gross profit.",
            "other_terms": ["Cost of Sales", "Cost of Revenue", "Production Costs"]
        },
        {
            "category":"Selling, General, and Administrative (SG&A)",
            "definition": "The expenses that are not directly tied to the production of goods or services. These expenses include salaries, rent, utilities, marketing, and office supplies. SG&A costs are crucial for understanding the company's overhead and operational efficiency.",
            "other_terms": ["Overhead Costs", "Operating Expenses", "Indirect Costs"]
        },
        {
            "category":"Research and Development (R&D)",
            "definition": "The expenses associated with the research and development of new products or services. These costs are crucial for innovation and future growth, allowing the company to stay competitive and develop new offerings.",
            "other_terms": ["Innovation Costs", "Development Expenditures", "R&D Costs"]
        },
        {
            "category":"Depreciation and Amortization",
            "definition": "The process of allocating the cost of tangible and intangible assets over their useful lives. Depreciation applies to tangible assets like machinery and buildings, while amortization applies to intangible assets like patents and trademarks.",
            "other_terms": ["Asset Depreciation", "Amortization Expense", "Non-cash Charges"]
        },
        {
            "category":"Interest Expense",
            "definition": "The cost incurred by the company for borrowed funds. This includes interest payments on loans, bonds, and other forms of debt. Interest expense is an important factor in evaluating the company's cost of financing and debt management.",
            "other_terms": ["Finance Costs", "Borrowing Costs", "Debt Expense"]
        },
        {
            "category":"Other Expenses",
            "definition": "Miscellaneous expenses that do not fit into other predefined categories. These can include a variety of minor or exceptional costs that are not directly related to core operations.",
            "other_terms": ["Sundry Expenses", "Miscellaneous Costs", "Additional Expenses"]
        },
        {
            "category":"Total Debt",
            "definition": "The total amount of money that the company owes to creditors, including both short-term and long-term debt. This figure is essential for assessing the company's financial obligations and leverage.",
            "other_terms": ["Aggregate Debt", "Total Liabilities", "Total Borrowings"]
        },
        {
            "category":"Debt-to-Equity Ratio",
            "definition": "A measure of a company's financial leverage, calculated by dividing total debt by total equity. It indicates the proportion of debt used to finance the company's assets and is a key indicator of financial risk.",
            "other_terms": ["Leverage Ratio", "D/E Ratio", "Debt Equity Ratio"]
        },
        {
            "category":"Long-Term Debt",
            "definition": "Debt that is due for repayment in more than one year. It typically includes bonds, long-term loans, and other similar obligations. Long-term debt is a critical factor in evaluating the company's long-term financial stability.",
            "other_terms": ["Non-current Liabilities", "Long-term Liabilities", "Long-term Borrowings"]
        },
        {
            "category":"Short-Term Debt",
            "definition": "Debt that is due for repayment within one year. It includes short-term loans, credit lines, and other similar obligations. Short-term debt is important for assessing the company's liquidity and short-term financial health.",
            "other_terms": ["Current Liabilities", "Short-term Liabilities", "Short-term Borrowings"]
        }, 
        {
            "category":"Total Equity",
            "definition": "The value of the shareholders' interest in the company, calculated as total assets minus total liabilities. It represents the residual interest in the assets of the company after deducting liabilities and is a key indicator of financial health.",
            "other_terms": ["Shareholders' Equity", "Owners' Equity", "Net Worth"]
        },
        {
            "category":"Gross Profit Margin",
            "definition":"The ratio of gross profit to revenue, expressed as a percentage. It indicates the efficiency with which a company produces and sells its products. A higher gross profit margin suggests better efficiency and cost management.",
            "other_terms": ["Gross Margin", "Gross Profit Ratio", "Gross Profit Percentage"]
        },

        {
            "category":"Operating Profit Margin",
            "definition":"The ratio of operating income to revenue, expressed as a percentage. It shows the proportion of revenue that remains after covering operating expenses. A higher operating profit margin indicates better operational efficiency.",
            "other_terms": ["Operating Margin", "Operating Income Ratio", "Operating Profit Percentage"]
        }, 
        
        {
            "category":"Net Profit Margin",
            "definition":"The ratio of net income to revenue, expressed as a percentage. It reflects the overall profitability of the company after all expenses have been deducted. A higher net profit margin indicates better overall financial performance.",
            "other_terms": ["Net Margin", "Net Income Ratio", "Net Profit Percentage"]
        }, 

        {
            "category":"Return on Assets (ROA)",
            "definition": "A measure of how profitable a company's assets are in generating revenue. It is calculated by dividing net income by total assets. ROA indicates how efficiently a company is using its assets to generate profit.",
            "other_terms": ["ROA", "Asset Efficiency Ratio", "Asset Return"]
        },

        {
            "category":"Return on Equity (ROE)",
            "definition": "A measure of the profitability of a business in relation to the equity. It is calculated by dividing net income by shareholders' equity. ROE indicates how effectively a company is using shareholders' equity to generate profit.",
            "other_terms": ["ROE", "Equity Return", "Shareholders' Return"]
        }
    ]
}